app/views/admin/setors/_form.html.erb

    <%= form.label :secretaria_id, style: "display: block" %>
    <%= form.collection_select :secretaria_id, Secretaria.all, :id, :nome, prompt: "Selecione uma Secretaria" %>
---
SELECT "secretarias".* FROM "secretarias"

    <%= form.label :unidade_id, style: "display: block" %>
    <%= form.collection_select :unidade_id, Unidade.all, :id, :nome, prompt: "Selecione uma unidade" %>
---
SELECT "unidades".* FROM "unidades"