app/controllers/admin/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT "funcionarios".* FROM "funcionarios"

  def new
    @funcionario = Funcionario.new
    @cargos_disponiveis = Cargo.all
---
SELECT "cargos".* FROM "cargos"

  def create
    @funcionario = Funcionario.new(funcionario_params)

    respond_to do |format|
      if @funcionario.save
---
INSERT INTO "funcionarios" ("nome", "cpf", "rg", "telefone", "created_at", "updated_at", "setor_id", "cargo_id", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "secretaria_id", "unidade_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def destroy
    @funcionario.destroy!
---
DELETE FROM "funcionarios" WHERE "funcionarios"."id" = $1  [["id", 5]]

    def set_funcionario
      @funcionario = Funcionario.find(params[:id])
---
SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]