app/controllers/admin/secretarias_controller.rb

  def index
    @secretarias = Secretaria.all
---
SELECT "secretarias".* FROM "secretarias"

  def create
    @secretaria = Secretaria.new(secretaria_params)

    respond_to do |format|
      if @secretaria.save
---
INSERT INTO "secretarias" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Secretaria 02"], ["created_at", "2024-01-25 02:21:52.668638"], ["updated_at", "2024-01-25 02:21:52.668638"]]

  def update
    respond_to do |format|
      if @secretaria.update(secretaria_params)
---
UPDATE "secretarias" SET "nome" = $1, "updated_at" = $2 WHERE "secretarias"."id" = $3  [["nome", "Secretaria 01"], ["updated_at", "2024-01-25 02:20:55.591290"], ["id", 1]]

  def destroy
    @secretaria.destroy!
---
DELETE FROM "secretarias" WHERE "secretarias"."id" = $1  [["id", 1]]

    def set_secretaria
      @secretaria = Secretaria.find_by(id: params[:id])
---
SELECT "secretarias".* FROM "secretarias" WHERE "secretarias"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]