app/controllers/admin/setors_controller.rb

SELECT "setors".* FROM "setors"
---
  def index
    @setors = Setor.all

INSERT INTO "setors" ("nome", "created_at", "updated_at", "unidade_id", "secretaria_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Ouvidoria"], ["created_at", "2024-01-25 04:18:48.287653"], ["updated_at", "2024-01-25 04:18:48.287653"], ["unidade_id", 1], ["secretaria_id", "[FILTERED]"]]
---
  def create
    @setor = Setor.new(setor_params)

    respond_to do |format|
      if @setor.save

DELETE FROM "setors" WHERE "setors"."id" = $1  [["id", 2]]
---
  def destroy
    @setor.destroy!

SELECT "setors".* FROM "setors" WHERE "setors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_setor
      @setor = Setor.find(params[:id])