app/controllers/admin/unidades_controller.rb

SELECT "unidades".* FROM "unidades"
---
  def index
    @unidades = Unidade.all

INSERT INTO "unidades" ("nome", "created_at", "updated_at", "secretaria_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Natal"], ["created_at", "2024-01-25 03:38:22.837080"], ["updated_at", "2024-01-25 03:38:22.837080"], ["secretaria_id", "[FILTERED]"]]
---
  def create
    @unidade = Unidade.new(unidade_params)

    respond_to do |format|
      if @unidade.save

UPDATE "unidades" SET "nome" = $1, "updated_at" = $2 WHERE "unidades"."id" = $3  [["nome", "Mossoró"], ["updated_at", "2024-01-25 02:47:05.652891"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @unidade.update(unidade_params)

DELETE FROM "unidades" WHERE "unidades"."id" = $1  [["id", 3]]
---
  def destroy
    @unidade.destroy!

SELECT "unidades".* FROM "unidades" WHERE "unidades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_unidade
      @unidade = Unidade.find(params[:id])