app/controllers/funcionarios/visitantes_controller.rb

SELECT "visitantes".* FROM "visitantes"
---
  def index
    @visitantes = Visitante.all

INSERT INTO "visitantes" ("nome", "cpf", "rg", "telefone", "foto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @visitante = Visitante.new(visitante_params)

    respond_to do |format|
      if @visitante.save

SELECT "visitantes".* FROM "visitantes" WHERE "visitantes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "visitantes" SET "telefone" = $1, "updated_at" = $2 WHERE "visitantes"."id" = $3  [["telefone", "007070070"], ["updated_at", "2024-01-25 01:46:33.914974"], ["id", 14]]
---
  def update
    @visitante = Visitante.find(params[:id])

    if @visitante.update(visitante_params)

DELETE FROM "visitantes" WHERE "visitantes"."id" = $1  [["id", 15]]
---
  def destroy
    @visitante.destroy!

SELECT "visitantes".* FROM "visitantes" WHERE "visitantes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_visitante
      @visitante = Visitante.find(params[:id])