app/views/admin/unidades/_form.html.erb

    <%= form.label :secretaria_id %>
    <%= form.collection_select :secretaria_id, Secretaria.all, :id, :nome, { prompt: 'Selecione uma secretaria' } %>
---
SELECT "secretarias".* FROM "secretarias"