app/views/funcionarios/_form.html.erb

SELECT "secretarias".* FROM "secretarias"
---
    <%= form.label :secretaria_id, style: "display: block" %>
    <%= form.collection_select :secretaria_id, Secretaria.all, :id, :nome, prompt: "Selecione uma secretaria" %>

SELECT "unidades".* FROM "unidades"
---
    <%= form.label :unidade_id, style: "display: block" %>
    <%= form.collection_select :unidade_id, Unidade.all, :id, :nome, prompt: "Selecione uma unidade" %>

SELECT "setors".* FROM "setors"
---
    <%= form.label :setor_id, style: "display: block" %>
    <%= form.collection_select :setor_id, Setor.all, :id, :nome, prompt: "Selecione um Setor" %>

SELECT "cargos".* FROM "cargos"
---
    <%= form.label :cargo_id, style: "display: block" %>
    <%= form.collection_select :cargo_id, Cargo.all, :id, :nome, prompt: "Selecione um cargo" %>